#### 1) Download college dataset from bucket:
#### `gsutil cp gs://cs327e-open-access/college_normalized.zip .`

#### 2) Load college dataset into BQ
#### Refer to https://cloud.google.com/bigquery/docs/reference/bq-cli-reference#top_of_page for documentation on bq tool and bq load command

In [1]:
dataset_id = "college"

In [2]:
!bq --location=US mk --dataset {dataset_id}

Dataset 'cs327e-sp2021:college' successfully created.

In [4]:
!bq --location=US load --autodetect --skip_leading_rows=1 \
--source_format=CSV {dataset_id}.Class '/home/jupyter/college_normalized/class.csv'

Upload complete.
Waiting on bqjob_r45f7ef7eabf0ac76_00000178b854cce0_1 ... (1s) Current status: DONE

In [5]:
!bq --location=US load --autodetect --skip_leading_rows=1 \
--source_format=CSV {dataset_id}.Student '/home/jupyter/college_normalized/student.csv'

Upload complete.
Waiting on bqjob_r366652aaf1d14bd1_00000178b854fc72_1 ... (2s) Current status: DONE

In [14]:
!bq --location=US load --autodetect --skip_leading_rows=1 \
--source_format=CSV {dataset_id}.Instructor '/home/jupyter/college_normalized/instructor.csv'

Upload complete.
Waiting on bqjob_r3d1dc951ee88a0dc_00000178b85678cb_1 ... (1s) Current status: DONE

In [7]:
!bq --location=US load --autodetect --skip_leading_rows=1 \
--source_format=CSV {dataset_id}.Takes '/home/jupyter/college_normalized/takes.csv'

Upload complete.
Waiting on bqjob_r32c8d36cc89a8b1_00000178b85543c6_1 ... (2s) Current status: DONE

In [8]:
!bq --location=US load --autodetect --skip_leading_rows=1 \
--source_format=CSV {dataset_id}.Teaches '/home/jupyter/college_normalized/teaches.csv'

Upload complete.
Waiting on bqjob_r3c0f5b8607cc9c02_00000178b8555c9e_1 ... (1s) Current status: DONE

#### Suppose that Student had not loaded correctly with the --autodetect option

In [9]:
%%bigquery
drop table college.Student

Empty DataFrame
Columns: []
Index: []

In [10]:
!bq --location=US load --skip_leading_rows=1 --allow_jagged_rows=true --source_format=CSV {dataset_id}.Student \
/home/jupyter/college_normalized/student.csv \
sid:STRING,fname:STRING,lname:STRING,dob:DATE,status:STRING

Upload complete.
Waiting on bqjob_r465f5bb46c929acc_00000178b855f048_1 ... (1s) Current status: DONE

#### Get record count for each table

In [11]:
%%bigquery
select count(*) as count from college.Student

   count
0     12

In [12]:
%%bigquery
select count(*) as count from college.Class

   count
0     11

In [15]:
%%bigquery
select count(*) as count from college.Instructor

   count
0     10

In [16]:
%%bigquery
select count(*) as count from college.Takes

   count
0     16

In [17]:
%%bigquery
select count(*) as count from college.Teaches

   count
0     12

#### Get sample records

In [18]:
%%bigquery
select * from college.Class
limit 5

      cno                             cname  credits
0  CS329E       Elements of Web Programming        3
1  CS327E             Elements of Databases        3
2  CS313E  Elements of Software Engineering        3
3  CS326E            Elements of Networking        3
4   M358K                Applied Statistics        3

In [19]:
%%bigquery
select * from college.Student
limit 5

        sid    fname     lname         dob status
0     kev18    Kevin       Lin  1999-10-05    CUR
1  sudeepa4  Sudeepa       Roy  2001-10-01    CUR
2    jerryh    Jerry  Hargrove  1999-01-03    CUR
3        jc    James      Cowe  2000-04-22    CUR
4     paulg     Paul      Gore  2000-09-17    CUR

In [23]:
%%bigquery
select * from college.Instructor
limit 5

  string_field_0 string_field_1    string_field_2
0         neeman     Joe Neeman       Mathematics
1           koch      Hans Koch       Mathematics
2        mueller  Peter Mueller       Mathematics
3           tran      Ngoc Tran       Mathematics
4         scohen  Shirley Cohen  Computer Science

In [21]:
%%bigquery
select * from college.Takes
limit 5

     sid     cno                             cname  credits grade
0  kev18   M362K                     Probability I        3     A
1  kev18  CS329E       Elements of Web Programming        3     A
2  paulg  CS329E       Elements of Web Programming        3     A
3  paulg  CS313E  Elements of Software Engineering        3     A
4     jc  CS327E             Elements of Databases        3     B

In [22]:
%%bigquery
select * from college.Teaches
limit 5

       tid    cno                 cname  credits
0   neeman  M362K         Probability I        3
1  mueller  M362K         Probability I        3
2  cannata  CS347       Data Management        3
3     tran  M358K    Applied Statistics        3
4  downing  CS373  Software Engineering        3

#### How should we fix the Instructor's schema?